# 20251271 최준오
# 2장 도전 프로그래밍 7번

print(f"{1:>2} {bin(1):>8} {oct(1):>6} {hex(1):>6}")
print(f"{2:>2} {bin(2):>8} {oct(2):>6} {hex(2):>6}")
print(f"{3:>2} {bin(3):>8} {oct(3):>6} {hex(3):>6}")
print(f"{4:>2} {bin(4):>8} {oct(4):>6} {hex(4):>6}")
print(f"{5:>2} {bin(5):>8} {oct(5):>6} {hex(5):>6}")
print(f"{6:>2} {bin(6):>8} {oct(6):>6} {hex(6):>6}")
print(f"{7:>2} {bin(7):>8} {oct(7):>6} {hex(7):>6}")
print(f"{8:>2} {bin(8):>8} {oct(8):>6} {hex(8):>6}")
print(f"{9:>2} {bin(9):>8} {oct(9):>6} {hex(9):>6}")
print(f"{10:>2} {bin(10):>8} {oct(10):>6} {hex(10):>6}")
